Creating Pandas series and indexing

In [2]:
import pandas as pd
age =[10,12,13,15,29,23,2,18,6]
name =['S1','S2','S3','S4','S5','S6','S7','S8','S9']
S = pd.Series(age,index =name)
print(S)

S1    10
S2    12
S3    13
S4    15
S5    29
S6    23
S7     2
S8    18
S9     6
dtype: int64

In [3]:
print(S['S1'])

10

In [4]:
print(S[2])

13

In [5]:
print(S[:3])

S1    10
S2    12
S3    13
dtype: int64

In [6]:
print(S[-1])

6

In [7]:
print(S.head())

S1    10
S2    12
S3    13
S4    15
S5    29
dtype: int64

In [8]:
print(S.head(3))

S1    10
S2    12
S3    13
dtype: int64

In [9]:
print(S.describe())

count     9.000000
mean     14.222222
std       8.303279
min       2.000000
25%      10.000000
50%      13.000000
75%      18.000000
max      29.000000
dtype: float64

In [10]:
print(S.tail())

S5    29
S6    23
S7     2
S8    18
S9     6
dtype: int64

In [11]:
print(S.tail(2))

S8    18
S9     6
dtype: int64

Data frames and operations

In [12]:
Sl =list('123456789')
S1 = pd.Series(Sl,index =name)
df = pd.DataFrame({'age':S,'Num':S1})
df

    age Num
S1   10   1
S2   12   2
S3   13   3
S4   15   4
S5   29   5
S6   23   6
S7    2   7
S8   18   8
S9    6   9

In [13]:
df1=pd.read_excel('Employee.xlsx')
print(df1)

   Employee ID     Name  Age  Gender   Location
0         1120    Rahul   35    Male      Delhi
1         1230   Mayuri   41  Female    Chennai
2         1250  Karthik   27    Male  Bangalore
3         1450   Pratik   32    Male      Delhi
4         1500      Das   40    Male  Bangalore
5         1600     Neha   28  Female    Chennai

In [14]:
print(df1['Name'])

0      Rahul
1     Mayuri
2    Karthik
3     Pratik
4        Das
5       Neha
Name: Name, dtype: object

In [15]:
print(df1.head())

   Employee ID     Name  Age  Gender   Location
0         1120    Rahul   35    Male      Delhi
1         1230   Mayuri   41  Female    Chennai
2         1250  Karthik   27    Male  Bangalore
3         1450   Pratik   32    Male      Delhi
4         1500      Das   40    Male  Bangalore

In [16]:
print(df1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  6 non-null      int64
 1   Name         6 non-null      object
 2   Age          6 non-null      int64
 3   Gender       6 non-null      object
 4   Location     6 non-null      object
dtypes: int64(2), object(3)
memory usage: 368.0+ bytes
None

In [19]:
print(df1.tail(2))

   Employee ID  Name  Age  Gender   Location
4         1500   Das   40    Male  Bangalore
5         1600  Neha   28  Female    Chennai

In [18]:
print(df1.loc[4])

Employee ID         1500
Name                 Das
Age                   40
Gender              Male
Location       Bangalore
Name: 4, dtype: object

In [20]:
print(df1[df1['Age']>30])

   Employee ID    Name  Age  Gender   Location
0         1120   Rahul   35    Male      Delhi
1         1230  Mayuri   41  Female    Chennai
3         1450  Pratik   32    Male      Delhi
4         1500     Das   40    Male  Bangalore

In [23]:
print(df1.sort_values('Age'))

   Employee ID     Name  Age  Gender   Location
2         1250  Karthik   27    Male  Bangalore
5         1600     Neha   28  Female    Chennai
3         1450   Pratik   32    Male      Delhi
0         1120    Rahul   35    Male      Delhi
4         1500      Das   40    Male  Bangalore
1         1230   Mayuri   41  Female    Chennai

In [24]:
print(df1.sort_values('Age').mean())

Employee ID    1358.333333
Age              33.833333
dtype: float64

In [29]:
print(df1.groupby('Gender').max('Age'))

        Employee ID  Age
Gender
Female         1600   41
Male           1500   40

In [30]:
print(df1.groupby('Gender').mean('Age'))

        Employee ID   Age
Gender
Female       1415.0  34.5
Male         1330.0  33.5

In [31]:
del df1['Location']
print(df1)

   Employee ID     Name  Age  Gender
0         1120    Rahul   35    Male
1         1230   Mayuri   41  Female
2         1250  Karthik   27    Male
3         1450   Pratik   32    Male
4         1500      Das   40    Male
5         1600     Neha   28  Female